window.addEventListener('load', function () {
    let body = document.body;
    let content = ["暗室不欺","不同流俗","不欺暗室","不忘沟壑","赤子之心","德厚流光","高情远致","高山景行","功德无量","厚德载物","怀瑾握瑜","蕙心纨质","见危授命","鞠躬尽瘁","死而后已","精金良玉","敬老慈幼","良金美玉","明德惟馨","年高德劭","前人栽树，后人乘凉","青天白日","山高水长","拾金不昧","玉洁松贞","沅茝沣兰","云中白鹤","志士仁人","补天浴日","风流人物","风华正茂","伏龙凤雏","盖世英雄","盖世无双","桂林一枝","鹤立鸡群","鹤鸣之士","加人一等","矫矫不群","金榜题名","举世","无双","绝世超伦","昆山片玉","人中之龙","首屈一指","铁中铮铮","头角峥嵘","无出其右","裒然举首","一代风流","一世龙门","庸中佼佼","不虞之誉","不 言而信","不","恶而严","荣华富贵","山中宰相","师道尊严","草木知威","驰名中外","大名鼎鼎","德高望重","风云人物","功成名遂","功标青史","赫赫有名","举世闻名","如雷贯耳","声振寰宇","威望素著","海阔天空","含垢纳污","呼牛呼马","豁达大度","既往不咎","宽大为怀","宽宏大量","网开一面","网开三面","息事宁人","下不为例","下车泣罪","胸怀祖国","放眼世界","严以律己","宽以待 人","以直报怨","以德报怨","宰相肚里能撑船","知情达理","中庸之道","将伯之助","解衣推食","救死扶伤","绝甘分少","普度众生","轻财好施","设身处地","疏财仗义","为民除害","为民请命","雪中送炭","与人为善","云行雨施","仗义疏财","助人为乐","生荣死哀","死得其所","万古千秋","万古流芳","为国捐躯","不耻最后","乘风破浪","顶天立地","鸿鹄之志","九天揽月","夸父追日","老骤伏枥","老当益壮","力争上游","陵云之志","猛志常在","磨杵成","针","穷而后工","三户亡秦","十载寒窗","铁杵成针","韦编三绝","心小志大","胸怀大志","雄飞雌伏","雄心壮志","燕雀安知鸿鹄之志","移山倒海","迎头赶上","有志者事竟成","愚公移山","争强好胜","知难而进","治国安民","志在四方","中流击楫","壮志凌云","自力更生","自强不息","自求多福","自食其力","大显神通","大显身手"," 大有作为","大器晚成","非池中物","奋发有为","公才公望","后生可畏","龙跃凤鸣","鹏程万里","前程万里","如日方升","发愤图强","奋发图强","奋发蹈厉","披荆斩棘","闻鸡起舞","八仙过海","不务空名","负重致远","掞藻飞声","碧血丹心","不避斧钺","成仁取义","赤胆忠心","赤心相","待","赤心报国","大节不夺","大法小廉","蹈节死义","断头将军","肝脑涂地","故旧不弃","故剑情深","寒花 晚节","久要不忘","扪心无愧","倩女离魂","舍身求法","田父","献曝","先驱蝼蚁","心虔志诚","以身殉职","以身许国","忧国奉公","孝子顺孙","忠孝节义","忠心耿耿","忠肝义胆","从容就义","富贵不能淫","海枯石烂","坚持不渝","坚韧不拔","坚定不移","雷打不动","木人石心","破釜沉舟","锲而不舍","誓死不二","心坚石穿","心如铁石","言必信，行必果","一不做，二不休","一口咬定","真金","不怕火炼","之死靡它","指天誓日","志坚行苦","至死不变","忠贞不渝","抱诚守真","诚心诚意","讲信修睦","金石为开","开心见诚","悃愊无华","披心相付","披肝沥胆","璞玉浑金","拳拳服膺","全心全意","推诚相信","推诚相见","推心置腹","推襟送抱","信及豚鱼","信誓旦旦","一寸丹心","允执其中","真心实意","不耻下问","不骄不躁","不矜不伐","不露圭角","辞尊居卑","功成不居","功薄蝉 翼","好问则裕","戒骄戒操","礼贤下士","满招损，谦受益","抛砖引玉","谦让末遑","谦虚谨慎","犬马之劳","深藏若虚","损之又损","闻过则喜","洗耳恭听","虚怀若谷","逊志时敏","言者无罪，闻者足戒","移樽就教","以莛叩钟","有则改之，无则加勉","愚者千虑， 必有一得","载酒问字","择善而从","知之为知之","自知之明","爱惜羽毛","刚毅木讷","画地为牢","斤斤自守","谨言慎行","慎终追远","守口如瓶","临事而惧","临深履薄","如临探渊","如履薄冰","奉命唯谨","三思而行","小心谨慎","小心翼翼","瞻前顾后","不忮不 求","澹泊寡欲","奉公守法","富贵浮云","廉洁奉公","两","袖清风","先公后私","纤尘不染","洗手奉职","枵腹从公","一尘不染","一介不取","一琴一鹤","饮马投钱","澡身浴德","大公无私","公事公办","公正无私","公而忘私","顾全大局","国尔忘家","毫不利已，专门利人","涓滴归公","开诚布公","克己奉公","嫠不恤纬","摩顶放踵","舍己为人","舍已救人","舍己从人","先人后己","先天下","之 忧而忧，后天下之乐而乐","修身洁行","一秉至公","衣被群生","以义割恩","不愧屋漏","大义凛然","大事不糊涂","风骨峭峻","刚肠 嫉恶","光风霁月","光明正大","光明磊落","浩然之气","襟怀坦白","明镜高悬","事无不可对人言","守正不阿","守经达权","堂堂正正","危言危行","行不更名，坐不改姓","行不由径","严气正性","正大光明","仗义执言","出生入死","奋不顾身","赴汤蹈火","浑身是胆","临危不惧","履险如夷","能征惯战","排除万难","前仆后继","群威群胆","杀敌致果","舍死忘生","舍得一身剐，敢把皇帝拉下马","视死如归","所向无前","天不怕，地不怕","挺身而出","铜头铁额","万死不辞","万夫不当","无所畏惧","降龙伏虎","一往无前","一身都是胆","一以当十","以一当十","义无反顾","勇者不惧","勇往直前","勇猛果敢","勇冠三军","浴血奋战","斩将搴旗","猪突豨勇"," 八斗之才","辩才无碍","不栉进士","才貌双全","才气过人","藏龙卧虎","沧海遗珠","出将入相","出类拔萃","出口成章","踔绝之能","大才盘盘","德才兼备","登高能赋","栋梁之材","斗南一人","斗酒","百篇","多才多艺","风流才子","风华绝代","凤毛麟角","高才疾足","高足弟子","国士无双","和氏之璧","鹤鸣九皋","后起之秀","锦心绣肠","金声玉振","金玉满堂","看","杀卫玠","经天纬地","麟风龟龙","灵蛇之珠","梦笔生花","面壁功深","妙手丹青","莫测高深","南州冠冕","南金东箭","能事毕矣","能者多劳","牛刀小试"," 女中尧舜","旁求俊彦","弸中彪外","七步之才","被褐怀玉","千里之足","强将手下无弱兵","巧同造化","三寸之舌","三头六臂","扫眉才子","珊瑚在网","神工鬼斧","升堂入室","淑质英才","腾蛟起凤","文武双全","文不加点","五言长城","下笔成篇","下笔成章","下 笔千言","贤良方正","新硎初试","雄才大略","秀出班行","药笼中物","衙官屈宋","游戏三昧","一技之长","一目十行","一世之雄"," 一柱擎天","倚马可待","有脚书橱","隐若敌国","玉堂金马","困任授官","真才实学","直谅多闻","智勇双全","着手成春","卓尔不群","左宜右有"
    ] //自定义内容的数组
    body.addEventListener('click', function (e) {
        let x = e.pageX;
        let y = e.pageY; //当前坐标
        let randContent = Math.ceil(Math.random() * content.length);
        let text = new Text(x, y, randContent);
        let span = document.createElement('span')
        span.style.color = text.getRandom();
        text.create(span);
        setTimeout(function () {
            text.out(span)
        }, 1900)
    })

    function Text(x, y, rand) {
        this.x = x;
        this.y = y;
        this.rand = rand;
    }
    Text.prototype.create = function (_this) {
        let body = document.body;
        _this.innerHTML = "❤"+content[this.rand - 1]+"❤";
        _this.className = 'text'
        _this.style.top = this.y - 20 + 'px'
        _this.style.left = this.x - 50 + 'px'
        _this.style.animation = 'remove 2s'
        body.appendChild(_this);
        let i = 0
        setInterval(() => {
            _this.style.top = this.y - 20 - i + 'px'
            i++
        }, 10);
    }
    Text.prototype.out = function (_this) {
        _this.remove()
    }
    //设置随机颜色
    Text.prototype.getRandom = function () {
        let allType = '0,1,2,3,4,5,6,7,8,9,a,b,c,d,e,f'; //16进制颜色
        let allTypeArr = allType.split(','); //通过','分割为数组
        let color = '#';
        for (var i = 0; i < 6; i++) {
            //随机生成一个0-16的数
            var random = parseInt(Math.random() * allTypeArr.length);
            color += allTypeArr[random];
        }
        return color; //返回随机生成的颜色
    }
})